frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103x6.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC2</name>
            <description>Analog to digital converter</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40012800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC1_2</name>
                <description>ADC2 global interrupt</description>
                <value>18</value>
            </interrupt>
            <registers>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDFLG</name>
                            <description>Analog watchdog flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOCFLG</name>
                            <description>Regular channel end of conversion</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJEOCFLG</name>
                            <description>Injected channel end of conversion</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJCSFLG</name>
                            <description>Injected channel start flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGCSFLG</name>
                            <description>Regular channel start flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDCHSEL</name>
                            <description>Analog watchdog channel select bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EOCIEN</name>
                            <description>Interrupt enable for EOC</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDIEN</name>
                            <description>Analog watchdog interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJEOCIEN</name>
                            <description>Interrupt enable for injected channels</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCANEN</name>
                            <description>Scan mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDSGLEN</name>
                            <description>Enable the watchdog on a single channel in scan mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJGACEN</name>
                            <description>Automatic injected group conversion</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGDISCEN</name>
                            <description>Discontinuous mode on regular channels</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJDISCEN</name>
                            <description>Discontinuous mode on injected channels</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISCNUMCFG</name>
                            <description>Discontinuous mode channel count</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DUALMCFG</name>
                            <description>Dual mode selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>INJAWDEN</name>
                            <description>Analog watchdog enable on injected channels</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGAWDEN</name>
                            <description>Analog watchdog enable on regular channels</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>control register 2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADCEN</name>
                            <description>A/D converter ON / OFF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONTCEN</name>
                            <description>Continuous conversion</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAL</name>
                            <description>A/D calibration</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CALRST</name>
                            <description>Reset calibration</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>Direct memory access mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DALIGNCFG</name>
                            <description>Data alignment</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJGEXTTRGSEL</name>
                            <description>External event select for injected group</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>INJEXTTRGEN</name>
                            <description>External trigger conversion mode for injected channels</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGEXTTRGSEL</name>
                            <description>External event select for regular group</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>REGEXTTRGEN</name>
                            <description>External trigger conversion mode for regular channels</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJSWSC</name>
                            <description>Start conversion of injected channels</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGSWSC</name>
                            <description>Start conversion of regular channels</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSVREFEN</name>
                            <description>Temperature sensor and VREFINT enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMPTIM1</name>
                    <displayName>SMPTIM1</displayName>
                    <description>sample time register 1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMPCYCCFG10</name>
                            <description>Channel 10 sample time selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG11</name>
                            <description>Channel 11 sample time selection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG12</name>
                            <description>Channel 12 sample time selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG13</name>
                            <description>Channel 13 sample time selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG14</name>
                            <description>Channel 14 sample time selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG15</name>
                            <description>Channel 15 sample time selection</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG16</name>
                            <description>Channel 16 sample time selection</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG17</name>
                            <description>Channel 17 sample time selection</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMPTIM2</name>
                    <displayName>SMPTIM2</displayName>
                    <description>sample time register 2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMPCYCCFG0</name>
                            <description>Channel 0 sample time selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG1</name>
                            <description>Channel 1 sample time selection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG2</name>
                            <description>Channel 2 sample time selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG3</name>
                            <description>Channel 3 sample time selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG4</name>
                            <description>Channel 4 sample time selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG5</name>
                            <description>Channel 5 sample time selection</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG6</name>
                            <description>Channel 6 sample time selection</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG7</name>
                            <description>Channel 7 sample time selection</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG8</name>
                            <description>Channel 8 sample time selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG9</name>
                            <description>Channel 9 sample time selection</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF1</name>
                    <displayName>INJDOF1</displayName>
                    <description>injected channel data offset register 1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF1</name>
                            <description>Data offset for injected channel 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF2</name>
                    <displayName>INJDOF2</displayName>
                    <description>injected channel data offset register 2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF2</name>
                            <description>Data offset for injected channel 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF3</name>
                    <displayName>INJDOF3</displayName>
                    <description>injected channel data offset register 3</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF3</name>
                            <description>Data offset for injected channel 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF4</name>
                    <displayName>INJDOF4</displayName>
                    <description>injected channel data offset register 4</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF4</name>
                            <description>Data offset for injected channel 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDHT</name>
                    <displayName>AWDHT</displayName>
                    <description>watchdog higher threshold register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <field>
                            <name>AWDHT</name>
                            <description>Analog watchdog higher threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDLT</name>
                    <displayName>AWDLT</displayName>
                    <description>watchdog lower threshold register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDLT</name>
                            <description>Analog watchdog lower threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
