frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103x6.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>AFIO</name>
            <description>Alternate function I/O</description>
            <groupName>AFIO</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EVCTRL</name>
                    <displayName>EVCTRL</displayName>
                    <description>Event control register (AFIO_EVCTRL)</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PINSEL</name>
                            <description>PINSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>PORTSEL</name>
                            <description>PORTSEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>EVOEN</name>
                            <description>EVOEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REMAP1</name>
                    <displayName>REMAP1</displayName>
                    <description>Alternate function IO remap and Serial wire JTAG configuration register (AFIO_REMAP1)</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>

                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI1RMP</name>
                            <description>SPI1 remapping</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1RMP</name>
                            <description>I2C1 remapping</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1RMP</name>
                            <description>USART1 remapping</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART2RMP</name>
                            <description>USART2 remapping</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>

                        <field>
                            <name>TMR1RMP</name>
                            <description>TMR1 remapping</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2RMP</name>
                            <description>TMR2 remapping</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR3RMP</name>
                            <description>TMR3 remapping</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>

                        <field>
                            <name>CAN1RMP</name>
                            <description>CAN1 alternate function remapping</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD01RMP</name>
                            <description>Port D0/Port D1 mapping on OSC_IN/OSC_OUT</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR5CH4IRMP</name>
                            <description>TMR5 channel4 internal remap</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC1_ETRGINJC_RMP</name>
                            <description>ADC 1 External trigger injected conversion remapping</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC1_ETRGREGC_RMP</name>
                            <description>ADC 1 external trigger regular conversion remapping</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC2_ETRGINJC_RMP</name>
                            <description>ADC 2 external trigger injected conversion remapping</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC2_ETRGREGC_RMP</name>
                            <description>ADC 2 external trigger regular conversion remapping</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>

                        <field>
                            <name>SWJCFG</name>
                            <description>Serial wire JTAG configuration</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTSEL1</name>
                    <displayName>EINTSEL1</displayName>
                    <description>External interrupt configuration register1 (AFIO_EINTSEL1)</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EINT0</name>
                            <description>EINT 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT1</name>
                            <description>EINT 1 configuration</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT2</name>
                            <description>EINT 2 configuration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT3</name>
                            <description>EINT 3 configuration</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTSEL2</name>
                    <displayName>EINTSEL2</displayName>
                    <description>External interrupt configuration register2 (AFIO_EINTSEL2)</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EINT4</name>
                            <description>EINT 4 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT5</name>
                            <description>EINT 5 configuration</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT6</name>
                            <description>EINT 6 configuration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT7</name>
                            <description>EINT 7 configuration</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTSEL3</name>
                    <displayName>EINTSEL3</displayName>
                    <description>External interrupt configuration register3 (AFIO_EINTSEL3)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EINT8</name>
                            <description>EINT 8 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT9</name>
                            <description>EINT 9 configuration</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT10</name>
                            <description>EINT 10 configuration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT11</name>
                            <description>EINT 11 configuration</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTSEL4</name>
                    <displayName>EINTSEL4</displayName>
                    <description>External interrupt configuration register4 (AFIO_EINTSEL4)</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EINT12</name>
                            <description>EINT 12 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT13</name>
                            <description>EINT 13 configuration</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT14</name>
                            <description>EINT 14 configuration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT15</name>
                            <description>EINT 15 configuration</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>

