frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103x6.svd
                <register>
                    <name>ADDR</name>
                    <displayName>ADDR</displayName>
                    <description>device address</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Device address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>USBDEN</name>
                            <description>Enable function</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUFFTB</name>
                    <displayName>BUFFTB</displayName>
                    <description>Buffer table address</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>BUFFTB</name>
                            <description>Buffer table</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWITCH</name>
                    <displayName>SWITCH</displayName>
                    <description>Switch register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>SWITCH</name>
                            <description>Switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
